In [1]:
import pandas as pd

In [3]:
data_frame = pd.read_excel("salary.xlsx")

In [4]:
data_frame

  Unnamed: 0   Maas   Yas Departman
0      Osman  30000  32.0   Yazılım
1      Kagan  25000  35.0     Hukuk
2        Ali  28000  23.0   Yazılım
3      Ahmet  23000  38.0       NaN
4     Hatice  20000   NaN   Tasarım
5      Busra  18000  25.0    Finans

In [6]:
not_nan_data_frame = data_frame.dropna()

In [7]:
not_nan_data_frame

  Unnamed: 0   Maas   Yas Departman
0      Osman  30000  32.0   Yazılım
1      Kagan  25000  35.0     Hukuk
2        Ali  28000  23.0   Yazılım
5      Busra  18000  25.0    Finans

In [8]:
not_nan_data_frame.to_excel("not_nan_salary.xlsx")